@extends('app')

@section('title', '【ベトナム語学習サービス】べとらん')

@section('content')
  @include('nav')
  <div class="container">
    <div class="card my-3 p-0">
    利用規約

    免責事項

    当サイトからのリンクやバナーなどで移動したサイトで提供される情報、サービス等について一切の責任を負いません。また当サイトのコンテンツについては、できる限り正確な情報を提供するよう努めておりますが、正確性や安全性を保証するものではなく、情報が古くなっていることもあります。当サイトに掲載された内容によって生じた損害等の一切の責任を負いかねますのでご了承ください。


    著作権について

    当サイトで掲載している文章や画像などについては、無断転載することを禁止します。
    当サイトは著作権や肖像権の侵害を目的としたものではありません。著作権や肖像権に関して問題がありましたら、お問い合わせフォームよりご連絡ください。迅速に対応いたします。


    リンクについて

    当ブログは基本的にリンクフリーです。リンクを行う場合の許可や連絡は不要です。ただし、インラインフレームの使用や画像の直リンクはご遠慮ください。

    </div>
  </div>


  @include('footer')
@endsection